{
  "EventDetails": [
    {
      "id": "1",
      "name": "Cosentino : Decennium - The Greatest Live Magic Show",
      "description": "Prepare to be mesmerised by the greatest magic show of the year! World-famous entertainer and International Magician of the Year, Cosentino, celebrates 10 years of global success with his brand new 90-minute stage production Cosentino : Decennium - The Greatest Live Magic Show.",
      "detailedDescription": "Cosentino will perform his most death-defying escapes, mind-boggling stage illusions, and cutting-edge street magic that will twist your view of reality. His trademark blend of dance and magic with a touch of hilarious audience participation will have you captivated from beginning to end.\n\nThis show is sure to keep you on the edge of your seats until the very last mind-bending moment. Now recognised as one of Australia’s most successful magicians, Cosentino has spent the last 10 years touring to packed houses and rave reviews around the world. A true trailblazer in the magic scene, he was the first Australian magician to have his own TV shows. His prime-time TV specials and AXN TV series “The Elements” have now been seen by over 750 million people across the globe. “The Elements” will soon be broadcasted locally on Mediacorp’s TV channel. \n\nCosentino: Decennium - The Greatest Live Magic Show guarantees a powerful and riveting experience and is most definitely one of Singapore's must-see shows of 2023!",
      "status": true,
      "thumbnail": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-04/cosentinod-eventmain-1194x556.jpg",
      "pictures": [
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-07/Cosentino_SISTIC-gallery1-1194x556-19Jul.jpg",
          "description": ""
        },
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-07/Cosentino_SISTIC-gallery2-1194x556-19Jul.jpg",
          "description": ""
        },
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-07/Cosentino_SISTIC-gallery3-1194x556-19Jul.jpg",
          "description": ""
        }
      ]
    },
    {
      "id": "2",
      "name": "Madagascar The Musical",
      "description": "Filled with outlandish characters, adventure galore and an upbeat score, you’ll have no choice but to “Move It, Move It!”",
      "detailedDescription": "Join Alex the Lion, Marty the Zebra, Melman the Giraffe, Gloria the hip hip Hippo and those hilarious, plotting penguins as they bound onto the stage in the musical adventure of a lifetime. Based on the smash hit DreamWorks animated motion picture, Madagascar – The Musical follows all your favourite cracka-lackin’ friends as they escape from their home in New York’s Central Park Zoo and find themselves on an unexpected journey to the madcap world of King Julien’s Madagascar.\n\nAlex the lion is the king of the urban jungle, the main attraction at New York’s Central Park Zoo. He and his best friends – Marty the zebra, Melman the giraffe and Gloria the hippo – have spent their whole lives in blissful captivity before an admiring public and with regular meals provided for them. Not content to leave well enough alone, Marty lets his curiosity get the better of him and makes his escape – with the help of some prodigious penguins – to explore the world.",
      "status": true,
      "thumbnail": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-06/madagascar0124%20main.jpg",
      "pictures": [
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-06/MAD_SISTIC-event-main-1194x556_V2.jpg",
          "description": ""
        },
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-06/MAD_SISTIC-event-main-1194x556_V3.jpg",
          "description": ""
        },
        {
          "url": "https://static.sistic.com.sg/sistic/docroot/sites/default/files/2023-06/MAD_SISTIC-event-main-1194x556_V4.jpg",
          "description": ""
        }
      ]
    },
    {
      "id": "3",
      "name": "Taylor Swift | The Eras Tour",
      "description": "Taylor Swift announced additional dates to Taylor Swift | The Eras Tour today. Singapore will be the only stop in Southeast Asia.",
      "detailedDescription": "Taylor Swift | The Eras Tour in Singapore is presented by Marina Bay Sands and supported by the Singapore Tourism Board, official bank and pre-sale partner UOB, and official experience partner Klook, promoted by AEG Presents Asia, and produced by Taylor Swift Touring.",
      "status": true,
      "thumbnail": "https://static.ticketmaster.sg/images/activity/24_taylorswift_709786be82b4d95608e614476288f5f1.jpg",
      "pictures": [
        {
          "url": "https://images.lifestyleasia.com/wp-content/uploads/sites/5/2023/07/05125108/taylor-hero-1600x900.png",
          "description": "This is a picture showcasing the keynote speaker for Event 2."
        },
        {
          "url": "https://cdn.tatlerasia.com/tatlerasia/i/2023/06/21135129-gettyimages-1497327442_cover_1600x1067.jpeg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        },
        {
          "url": "https://images.lifestyleasia.com/wp-content/uploads/sites/6/2023/06/21011356/taylor-swift-the-eras-tour-singapore-march-2024-tickets-prices-venue-dates-live-concert-presale-details.jpg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        }
      ]
    },
    {
      "id": "4",
      "name": "Coldplay: Music Of The Spheres World Tour",
      "description": "Following the spectacular sellout success of Coldplay’s newly announced January and February 2024 dates in Asia, the band have today announced additional dates as part of their record-breaking Music Of The Spheres World Tour.",
      "detailedDescription": "Already making history for announcing an unprecedented four-show run at Singapore’s largest venue, Coldplay will now be the first act ever to play five nights at Singapore’s National Stadium. The band also broke Singapore’s record for most tickets sold by an artist in a single day, surpassing 200,000.\n\nSince the first Music Of The Spheres World Tour date in March 2022, the band have sold over 7 million tickets - the most for any tour over the last two years. The tour has also received rave reviews from fans and critics alike, picking up accolades including Favorite Touring Artist at the 2022 AMAs and Tour of The Year at the 2023 iHeartRadio Awards.",
      "status": true,
      "thumbnail": "https://static.ticketmaster.sg/images/activity/24_coldplay_21f711a927e7b936ca148ee1c83bf81d.png",
      "pictures": [
        {
          "url": "https://pyxis.nymag.com/v1/imgs/290/695/356e33bc1900f775d28c6e487b2c3563b9-coldplay.jpg",
          "description": "This is a picture showcasing the keynote speaker for Event 2."
        },
        {
          "url": "https://cdn.tatlerasia.com/tatlerasia/i/2023/05/10161114-coldplay-concert-music-of-the-spheres-world-tour-5_cover_1600x938.jpg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        },
        {
          "url": "https://images.lifestyleasia.com/wp-content/uploads/sites/7/2023/06/12102751/Cold-play-1600x900.jpg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        }
      ]
    },
    {
      "id": "5",
      "name": "TWICE 5TH WORLD TOUR 'READY TO BE'",
      "description": "Live Nation Singapore is thrilled to announce that South Korean girl group TWICE, comprising NAYEON, JEONGYEON, MOMO, SANA, JIHYO, MINA, DAHYUN, CHAEYOUNG and TZUYU, will return to Singapore after 4 years as part of their ongoing ‘READY TO BE’ world tour!",
      "detailedDescription": "Formed under K-pop powerhouse JYP Entertainment in 2015, TWICE is one of the best-selling K-pop girl groups of all time regarding physical album sales. The group first rose to prominence with their debut title song “Like OOH-AHH” and 2016 breakthrough single “CHEER UP,” which went on to top multiple Korean pop charts and won ‘Song of the Year’ at the Melon Music Awards and Mnet Asian Music Awards. The group has been included in numerous industry lists including Variety’s Youth Impact Report as the only K-pop group included in the list, Forbes Korea Power Celebrity issue in both 2019 and 2017, and Billboard’s 21 Under 21 2017: Music’s Next Generation issue in 18th place and as the only Asian act.",
      "status": true,
      "thumbnail": "https://static.ticketmaster.sg/images/activity/23_twice_2ed7e28dc40d5526100fb4128593a704.jpg",
      "pictures": [
        {
          "url": "https://0.soompi.io/wp-content/uploads/2019/07/13231112/e01.jpg",
          "description": "This is a picture showcasing the keynote speaker for Event 2."
        },
        {
          "url": "https://bandwagon-gig-finder.s3.amazonaws.com/editorials/uploads/pictures/14034/content_M_020585.jpg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        },
        {
          "url": "https://dopinrae12872.cloudfront.net/wp-content/uploads/2017/05/CAM10073.jpg",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        }
      ]
    },
    {
      "id": "6",
      "name": "Backstreet Boys: DNA World Tour 2023",
      "description": "Live Nation is thrilled to announce Backstreet Boys, one of the best-selling bands of all time, will bring their highly anticipated DNA WORLD TOUR 2023 to Asia due to incredible popular demand. Backstreet Boys will tour in multiple cities including Tokyo, Kaohsiung, Manila and Singapore.",
      "detailedDescription": "In May 2019, the Backstreet Boys kicked off “The DNA World Tour” - the group’s biggest arena tour in 18 years thanks to the global success of their #1 new album. The DNA World Tour has seen the group sell out arenas all over North America, Europe, Asia, and South America.\n\nDNA WORLD TOUR 2023 LIVE IN SINGAPORE will take place at Singapore Indoor Stadium on 22 February (Wednesday) 2023. Fan Club presale starts on 7 November (Monday) from 10am – 11:59pm, and limited VIP packages will be available for purchase on 8 November (Tuesday) from 10am onwards, where super fans can get up-close and personal with the group. ",
      "status": true,
      "thumbnail": "https://res.klook.com/image/upload/v1667546820/src17slt6j1qglg7cjek.jpg",
      "pictures": [
        {
          "url": "https://static.thehoneycombers.com/wp-content/uploads/sites/2/2017/09/backstreet-boys-singapore-live.jpg",
          "description": "This is a picture showcasing the keynote speaker for Event 2."
        },
        {
          "url": "https://www.billboard.com/wp-content/uploads/media/backstreet-boys-clarkston-performance-2015-billboard-650.jpg?w=650",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        },
        {
          "url": "https://images-sg.girlstyle.com/wp-content/uploads/2022/11/5dc74e0a.jpeg?auto=format&w=1053",
          "description": "This is another picture showcasing the workshops conducted at Event 2."
        }
      ]
    }
  ]
}
